Revit 2027 API
ParameterTypeId.CurveIsFilled Property
 "Filled"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveIsFilled { get; }
Public Shared ReadOnly Property CurveIsFilled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveIsFilled {
	ForgeTypeId^ get ();
}
static member CurveIsFilled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace